**Afshin Bayatpour, Email: afshin.bayatpour@gmail.com**

In [1]:
import numpy as np
import pandas as pd
import sqlite3 as sql
import matplotlib.pyplot as plt
conn = sql.connect('example.db')

#Joins

Create two tables named Address and Number as:


```
+----+-------+--------------+
| Id | Name  | Location     | 
+----+-------+--------------+
| 1  | Joe   | 1370 Way St. |
| 2  | Henry | 34 Apple Dr. |
| 3  | Sam   | 60 Moon Rd.  |
| 4  | Max   | 95 Main St.  |
+----+-------+--------------+
```



```
+----+-------+--------------+
| Id | Name  | Phone Number | 
+----+-------+--------------+
| 1  | Joe   | 1234567890   |
| 5  | Candy | 1230987654   |
| 7  | Bob   | 1235476980   |
| 4  | Max   | 1239078564   |
+----+-------+--------------+
```

Use the appropriate Join to Get an output as:



```
+----+-------+--------------+--------------+
| Id | Name  | Location     | Number       |
+----+-------+--------------+--------------+
| 1  | Joe   | 1370 Way St. | 1234567890   |
| 4  | Max   | 95 Main St.  | 1239078564   |
+----+-------+--------------+--------------+
```

In [2]:
address = pd.DataFrame(([[1, 'Joe', "1370 Way St."], [2, 'Henry', "34 Apple Dr."], [3, 'Sam', "60 Moon Rd."], [4,'Max',"95 Main St."]]),
                   columns=['Id', 'Name', 'Location'])
address.to_sql('address', con=conn, if_exists='replace')
number = pd.DataFrame(([[1, 'Joe', 1234567890], [5, 'Candy', 1230987654 ], [7, 'Bob', 1235476980], [4,'Max', 1239078564]]),
                   columns=['Id', 'Name', 'Phone Number'])
number.to_sql('number', con=conn, if_exists='replace')

C:\Users\AfshIn\anaconda3\lib\site-packages\pandas\core\generic.py:2653: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [3]:
pd.read_sql("SELECT a.Id, a.Name, a.Location, cast(b.`Phone Number` as real) as Number\
            FROM address as a\
            LEFT JOIN number as b\
            on a.ID = b.ID", con = conn).dropna()

   Id Name      Location        Number
0   1  Joe  1370 Way St.  1.234568e+09
3   4  Max   95 Main St.  1.239079e+09

#Technical Questions

**NOTE** You are going to have to create the initial table or Schema first for the following questions.

##Rising Temperature



Write an SQL query to find all dates' id with higher temperature compared to its previous dates (yesterday).

Return the result table in any order.

The query result format is in the following example:



```
Weather
+----+------------+-------------+
| id | recordDate | Temperature |
+----+------------+-------------+
| 1  | 2015-01-01 | 10          |
| 2  | 2015-01-02 | 25          |
| 3  | 2015-01-03 | 20          |
| 4  | 2015-01-04 | 30          |
+----+------------+-------------+

Result table:
+----+
| id |
+----+
| 2  |
| 4  |
+----+
In 2015-01-02, temperature was higher than the previous day (10 -> 25).
In 2015-01-04, temperature was higher than the previous day (20 -> 30).
```

In [4]:
Weather = pd.DataFrame(([[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4,'2015-01-04 ',30]]),
                   columns=['id', 'recordDate', 'Temperature'])
Weather.to_sql('Weather', con=conn, if_exists='replace')
Weather

   id   recordDate  Temperature
0   1   2015-01-01           10
1   2   2015-01-02           25
2   3   2015-01-03           20
3   4  2015-01-04            30

In [5]:
pd.read_sql("SELECT a.id\
            FROM Weather as a\
            join Weather as b\
            WHERE (a.id = b.id + 1) and (a.Temperature > b.Temperature)", con = conn)

   id
0   2
1   4

##Second Highest Salary

Write a SQL query to get the second highest salary from the Employee table.


```
+----+--------+
| Id | Salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
```
For example, given the above Employee table, the query should return 200 as the second highest salary. If there is no second highest salary, then the query should return null.


```
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
```

In [6]:
employee = pd.DataFrame(([[1, 100], [2, 200], [3, 300]]),
                   columns=['Id', 'Salary'])
employee.to_sql('employee', con=conn, if_exists='replace')
employee

   Id  Salary
0   1     100
1   2     200
2   3     300

In [7]:
pd.read_sql("SELECT Salary as SecondHighestSalary From (SELECT ROW_NUMBER () OVER (ORDER BY Salary) AS RowNum, Salary FROM employee) \
            WHERE RowNum =2" ,con = conn)

   SecondHighestSalary
0                  200